# Extract the Olympic, Population, Population Density, and GDP csv Data.

In [1]:
# Import dependencies
import pandas as pd
import numpy as np
import json
pd.set_option('max_colwidth', 400)

In [2]:
# Read the Olympic data into a Pandas DataFrame.
olympic_df = pd.read_csv('Resources/Olympics.csv', header=0)
olympic_df.head()

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
0,1,A Dijiang,M,24.0,180.0,80.0,China,CHN,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,NaN
1,2,A Lamusi,M,23.0,170.0,60.0,China,CHN,2012 Summer,2012,Summer,London,Judo,Judo Men's Extra-Lightweight,NaN
2,3,Gunnar Nielsen Aaby,M,24.0,NaN,NaN,Denmark,DEN,1920 Summer,1920,Summer,Antwerpen,Football,Football Men's Football,NaN
3,4,Edgar Lindenau Aabye,M,34.0,NaN,NaN,Denmark,DEN,1900 Summer,1900,Summer,Paris,Tug-Of-War,Tug-Of-War Men's Tug-Of-War,Gold
4,5,Christine Jacoba Aaftink,F,21.0,185.0,82.0,Netherlands,NED,1988 Winter,1988,Winter,Calgary,Speed Skating,Speed Skating Women's 500 metres,NaN

In [3]:
# Change NaN values to null values
olympic_df.replace(np.nan, None, inplace=True)

# Display the DataFrame with NaN values replaced by null values
olympic_df.head()

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
0,1,A Dijiang,M,24.0,180.0,80.0,China,CHN,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,None
1,2,A Lamusi,M,23.0,170.0,60.0,China,CHN,2012 Summer,2012,Summer,London,Judo,Judo Men's Extra-Lightweight,None
2,3,Gunnar Nielsen Aaby,M,24.0,None,None,Denmark,DEN,1920 Summer,1920,Summer,Antwerpen,Football,Football Men's Football,None
3,4,Edgar Lindenau Aabye,M,34.0,None,None,Denmark,DEN,1900 Summer,1900,Summer,Paris,Tug-Of-War,Tug-Of-War Men's Tug-Of-War,Gold
4,5,Christine Jacoba Aaftink,F,21.0,185.0,82.0,Netherlands,NED,1988 Winter,1988,Winter,Calgary,Speed Skating,Speed Skating Women's 500 metres,None

In [4]:
# Concatenate Team and Year
olympic_df['Country_Year'] = olympic_df['Team'] + ' ' + olympic_df['Year'].astype(str)

# Display the DataFrame with the new index column as the first column
olympic_df.head()

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal,Country_Year
0,1,A Dijiang,M,24.0,180.0,80.0,China,CHN,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,None,China 1992
1,2,A Lamusi,M,23.0,170.0,60.0,China,CHN,2012 Summer,2012,Summer,London,Judo,Judo Men's Extra-Lightweight,None,China 2012
2,3,Gunnar Nielsen Aaby,M,24.0,None,None,Denmark,DEN,1920 Summer,1920,Summer,Antwerpen,Football,Football Men's Football,None,Denmark 1920
3,4,Edgar Lindenau Aabye,M,34.0,None,None,Denmark,DEN,1900 Summer,1900,Summer,Paris,Tug-Of-War,Tug-Of-War Men's Tug-Of-War,Gold,Denmark 1900
4,5,Christine Jacoba Aaftink,F,21.0,185.0,82.0,Netherlands,NED,1988 Winter,1988,Winter,Calgary,Speed Skating,Speed Skating Women's 500 metres,None,Netherlands 1988

In [5]:
# Move 'Country_Year' column after 'ID' column
cols = list(olympic_df.columns)
cols.insert(1, cols.pop(cols.index('Country_Year')))
olympic_df = olympic_df[cols]

# Display the DataFrame with 'Country_Year' column after 'ID' column
olympic_df.head()

,ID,Country_Year,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
0,1,China 1992,A Dijiang,M,24.0,180.0,80.0,China,CHN,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,None
1,2,China 2012,A Lamusi,M,23.0,170.0,60.0,China,CHN,2012 Summer,2012,Summer,London,Judo,Judo Men's Extra-Lightweight,None
2,3,Denmark 1920,Gunnar Nielsen Aaby,M,24.0,None,None,Denmark,DEN,1920 Summer,1920,Summer,Antwerpen,Football,Football Men's Football,None
3,4,Denmark 1900,Edgar Lindenau Aabye,M,34.0,None,None,Denmark,DEN,1900 Summer,1900,Summer,Paris,Tug-Of-War,Tug-Of-War Men's Tug-Of-War,Gold
4,5,Netherlands 1988,Christine Jacoba Aaftink,F,21.0,185.0,82.0,Netherlands,NED,1988 Winter,1988,Winter,Calgary,Speed Skating,Speed Skating Women's 500 metres,None

In [6]:
# Convert the DataFrame to a list of dictionaries.
dict_values = olympic_df.to_dict(orient='records')

# Write the list of dictionaries to a JSON file.
with open('olympics.json', 'w') as json_file:
    json.dump(dict_values, json_file, indent=4)

print("Data has been successfully converted to JSON and saved to 'olympics.json'")

Data has been successfully converted to JSON and saved to 'olympics.json'

In [7]:
# Read the Olympic data into a Pandas DataFrame.
medal_df = pd.read_csv('Resources/Medal Counts.csv', header=0)
medal_df.head()

,Country_Year,Year,BronzeCount,SilverCount,GoldCount,TotalMedalCount,Density Value,GDP Value,Pop Value,DensityPerBronze,...,DensityPerGold,DensityPerTotal,GDPPerBronze,GDPPerSilver,GDPPerGold,GDPPerTotal,PopulationPerBronze,PopulationPerSilver,PopulationPerGold,PopulationPerTotal
0,Afghanistan 2008,2008,1,0,0,1,40.518221,1.010930e+10,26427199,40.518221,...,NaN,40.518221,1.010930e+10,NaN,NaN,1.010930e+10,26427199.0,NaN,NaN,2.642720e+07
1,Afghanistan 2012,2012,1,0,0,1,46.711251,1.990733e+10,30466479,46.711251,...,NaN,46.711251,1.990733e+10,NaN,NaN,1.990733e+10,30466479.0,NaN,NaN,3.046648e+07
2,Algeria 1984,1984,2,0,0,2,8.982311,5.369855e+10,21393530,4.491156,...,NaN,4.491156,2.684927e+10,NaN,NaN,2.684927e+10,10696765.0,NaN,NaN,1.069676e+07
3,Algeria 1992,1992,1,0,1,2,11.230572,4.800313e+10,26748303,11.230572,...,11.230572,5.615286,4.800313e+10,NaN,4.800313e+10,2.400157e+10,26748303.0,NaN,26748303.0,1.337415e+07
4,Algeria 1996,1996,1,0,2,3,12.169521,4.694155e+10,28984634,12.169521,...,6.084760,4.056507,4.694155e+10,NaN,2.347078e+10,1.564718e+10,28984634.0,NaN,14492317.0,9.661545e+06

In [8]:
# Change NaN values to null values
medal_df.replace(np.nan, None, inplace=True)

# Display the DataFrame with NaN values replaced by null values
medal_df.head()

,Country_Year,Year,BronzeCount,SilverCount,GoldCount,TotalMedalCount,Density Value,GDP Value,Pop Value,DensityPerBronze,...,DensityPerGold,DensityPerTotal,GDPPerBronze,GDPPerSilver,GDPPerGold,GDPPerTotal,PopulationPerBronze,PopulationPerSilver,PopulationPerGold,PopulationPerTotal
0,Afghanistan 2008,2008,1,0,0,1,40.518221,1.010930e+10,26427199,40.518221,...,None,40.518221,10109296958.0,None,None,1.010930e+10,26427199.0,None,None,2.642720e+07
1,Afghanistan 2012,2012,1,0,0,1,46.711251,1.990733e+10,30466479,46.711251,...,None,46.711251,19907329906.0,None,None,1.990733e+10,30466479.0,None,None,3.046648e+07
2,Algeria 1984,1984,2,0,0,2,8.982311,5.369855e+10,21393530,4.491156,...,None,4.491156,26849274146.5,None,None,2.684927e+10,10696765.0,None,None,1.069676e+07
3,Algeria 1992,1992,1,0,1,2,11.230572,4.800313e+10,26748303,11.230572,...,11.230572,5.615286,48003133347.0,None,48003133347.0,2.400157e+10,26748303.0,None,26748303.0,1.337415e+07
4,Algeria 1996,1996,1,0,2,3,12.169521,4.694155e+10,28984634,12.169521,...,6.08476,4.056507,46941554225.0,None,23470777112.5,1.564718e+10,28984634.0,None,14492317.0,9.661545e+06

In [9]:
# Convert the DataFrame to a list of dictionaries.
dict_values = medal_df.to_dict(orient='records')

# Write the list of dictionaries to a JSON file.
with open('medal count.json', 'w') as json_file:
    json.dump(dict_values, json_file, indent=4)

print("Data has been successfully converted to JSON and saved to 'medal count.json'")

Data has been successfully converted to JSON and saved to 'medal count.json'

In [10]:
# Read the Density data into a Pandas DataFrame.
density_df = pd.read_csv('Resources/Density_load.csv', header=0)
density_df.head()

,Country Name,Country Code,D-Indicator Name,D-Indicator Code,Attribute.1,Year,Value
0,Aruba,ABW,Population density (people per sq. km of land area),EN.POP.DNST,D,1961,310.061111
1,Aruba,ABW,Population density (people per sq. km of land area),EN.POP.DNST,D,1962,314.900000
2,Aruba,ABW,Population density (people per sq. km of land area),EN.POP.DNST,D,1963,319.305556
3,Aruba,ABW,Population density (people per sq. km of land area),EN.POP.DNST,D,1964,323.211111
4,Aruba,ABW,Population density (people per sq. km of land area),EN.POP.DNST,D,1965,326.566667

In [11]:
density_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14901 entries, 0 to 14900
Data columns (total 7 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Country Name      14901 non-null  object
 1   Country Code      14901 non-null  object
 2   D-Indicator Name  14901 non-null  object
 3   D-Indicator Code  14901 non-null  object
 4   Attribute.1       14901 non-null  object
 5   Year              14901 non-null  int64
 6   Value             14901 non-null  float64
dtypes: float64(1), int64(1), object(5)
memory usage: 815.0+ KB

In [12]:
# Drop unnecessary columns
density_df.drop(columns=['D-Indicator Name', 'D-Indicator Code', 'Attribute.1'], inplace=True)

# Display the modified DataFrame
density_df.head()

  Country Name Country Code  Year       Value
0        Aruba          ABW  1961  310.061111
1        Aruba          ABW  1962  314.900000
2        Aruba          ABW  1963  319.305556
3        Aruba          ABW  1964  323.211111
4        Aruba          ABW  1965  326.566667

In [13]:
# Rename the 'Value' column
density_df.rename(columns={'Value': 'Density'}, inplace=True)

# Display the modified DataFrame
density_df.head()

  Country Name Country Code  Year     Density
0        Aruba          ABW  1961  310.061111
1        Aruba          ABW  1962  314.900000
2        Aruba          ABW  1963  319.305556
3        Aruba          ABW  1964  323.211111
4        Aruba          ABW  1965  326.566667

In [14]:
# Convert the DataFrame to a list of dictionaries.
dict_values = density_df.to_dict(orient='records')

# Write the list of dictionaries to a JSON file.
with open('density.json', 'w') as json_file:
    json.dump(dict_values, json_file, indent=4)

print("Data has been successfully converted to JSON and saved to 'density.json'")

Data has been successfully converted to JSON and saved to 'density.json'

In [15]:
# Read the GDP data into a Pandas DataFrame.
gdp_df = pd.read_csv('Resources/GDP_load.csv', header=0)
gdp_df.head()

,Country Name,Country Code,G-Indicator Name,G-Indicator Code,Attribute.1,Year,Value
0,Aruba,ABW,GDP (current US$),NY.GDP.MKTP.CD,G,1986,405586592.2
1,Aruba,ABW,GDP (current US$),NY.GDP.MKTP.CD,G,1987,487709497.2
2,Aruba,ABW,GDP (current US$),NY.GDP.MKTP.CD,G,1988,596648044.7
3,Aruba,ABW,GDP (current US$),NY.GDP.MKTP.CD,G,1989,695530726.3
4,Aruba,ABW,GDP (current US$),NY.GDP.MKTP.CD,G,1990,764804469.3

In [16]:
# Drop unnecessary columns
gdp_df.drop(columns=['G-Indicator Name', 'G-Indicator Code', 'Attribute.1'], inplace=True)

# Display the modified DataFrame
gdp_df.head()

  Country Name Country Code  Year        Value
0        Aruba          ABW  1986  405586592.2
1        Aruba          ABW  1987  487709497.2
2        Aruba          ABW  1988  596648044.7
3        Aruba          ABW  1989  695530726.3
4        Aruba          ABW  1990  764804469.3

In [17]:
# Rename the 'Value' column
gdp_df.rename(columns={'Value': 'GDP'}, inplace=True)

# Display the modified DataFrame
gdp_df.head()

  Country Name Country Code  Year          GDP
0        Aruba          ABW  1986  405586592.2
1        Aruba          ABW  1987  487709497.2
2        Aruba          ABW  1988  596648044.7
3        Aruba          ABW  1989  695530726.3
4        Aruba          ABW  1990  764804469.3

In [18]:
# Convert the DataFrame to a list of dictionaries.
dict_values = gdp_df.to_dict(orient='records')

# Write the list of dictionaries to a JSON file.
with open('gdp.json', 'w') as json_file:
    json.dump(dict_values, json_file, indent=4)

print("Data has been successfully converted to JSON and saved to 'gdp.json'")

Data has been successfully converted to JSON and saved to 'gdp.json'

In [19]:
# Read the Population data into a Pandas DataFrame.
population_df = pd.read_csv('Resources/Population_load.csv', header=0)
population_df.head()

,Country Name,Country Code,P-Indicator Name,P-Indicator Code,Attribute.1,Year,Value
0,Aruba,ABW,"Population, total",SP.POP.TOTL,P,1960,54608
1,Aruba,ABW,"Population, total",SP.POP.TOTL,P,1961,55811
2,Aruba,ABW,"Population, total",SP.POP.TOTL,P,1962,56682
3,Aruba,ABW,"Population, total",SP.POP.TOTL,P,1963,57475
4,Aruba,ABW,"Population, total",SP.POP.TOTL,P,1964,58178

In [20]:
# Drop unnecessary columns
population_df.drop(columns=['P-Indicator Name', 'P-Indicator Code', 'Attribute.1'], inplace=True)

# Display the modified DataFrame
population_df.head()

  Country Name Country Code  Year  Value
0        Aruba          ABW  1960  54608
1        Aruba          ABW  1961  55811
2        Aruba          ABW  1962  56682
3        Aruba          ABW  1963  57475
4        Aruba          ABW  1964  58178

In [21]:
# Rename the 'Value' column
population_df.rename(columns={'Value': 'Population'}, inplace=True)

# Display the modified DataFrame
population_df.head()

  Country Name Country Code  Year  Population
0        Aruba          ABW  1960       54608
1        Aruba          ABW  1961       55811
2        Aruba          ABW  1962       56682
3        Aruba          ABW  1963       57475
4        Aruba          ABW  1964       58178

In [22]:
# Convert the DataFrame to a list of dictionaries.
dict_values = population_df.to_dict(orient='records')

# Write the list of dictionaries to a JSON file.
with open('population.json', 'w') as json_file:
    json.dump(dict_values, json_file, indent=4)

print("Data has been successfully converted to JSON and saved to 'population.json'")

Data has been successfully converted to JSON and saved to 'population.json'

In [23]:
import numpy as np

# Concatenate 'Country Name' and 'Year' columns to create a new column
density_df['Country_Year'] = density_df['Country Name'] + '_' + density_df['Year'].astype(str)
gdp_df['Country_Year'] = gdp_df['Country Name'] + '_' + gdp_df['Year'].astype(str)
population_df['Country_Year'] = population_df['Country Name'] + ' ' + population_df['Year'].astype(str)

# Replace null values with a specific value
density_df.fillna(value=np.nan, inplace=True)
gdp_df.fillna(value=np.nan, inplace=True)
population_df.fillna(value=np.nan, inplace=True)

# Merge the dataframes based on the 'Country Name' and 'Year' columns
merged_df = pd.merge(density_df, gdp_df, on=['Country Name', 'Year'], how='outer')
merged_df = pd.merge(merged_df, population_df, on=['Country Name', 'Year'], how='outer')

# Select specific columns to keep
merged_df = merged_df[['Country Name', 'Year', 
                       'Density',
                       'GDP', 'Country Code', 'Population', 
                       'Country_Year']]

merged_df.head()

  Country Name  Year     Density  GDP Country Code  Population Country_Year
0        Aruba  1961  310.061111  NaN          ABW       55811   Aruba 1961
1        Aruba  1962  314.900000  NaN          ABW       56682   Aruba 1962
2        Aruba  1963  319.305556  NaN          ABW       57475   Aruba 1963
3        Aruba  1964  323.211111  NaN          ABW       58178   Aruba 1964
4        Aruba  1965  326.566667  NaN          ABW       58782   Aruba 1965

In [24]:
# Export the merged dataframe to a JSON file
merged_df.to_json('merged_data.json', orient='records')

print("Data has been successfully merged and saved to 'merged_data.json'")

Data has been successfully merged and saved to 'merged_data.json'